R/R-seededlda/files/patch-fix-finding-TBB.diff
--- configure	2024-09-05 13:04:35.000000000 +0800
+++ configure	2024-09-06 13:45:20.000000000 +0800
@@ -4319,7 +4319,7 @@
   { printf "%s\n" "$as_me:${as_lineno-$LINENO}: checking Intel TBB existence:" >&5
 printf %s "checking Intel TBB existence:... " >&6; }
   TBB_EXISTS=no
-  pkg-config --exists tbb >/dev/null 2>&1
+  pkg-config --exists tbb@BIT@ >/dev/null 2>&1
   SH_TBB_EXISTS=`echo $?`
   if test ${SH_TBB_EXISTS} = 0 ; then
     TBB_EXISTS=yes
@@ -4342,9 +4342,9 @@
   fi
 
   if test ${TBB_EXISTS} = yes ; then
-    TBBFLAGS="-DTBB $(pkg-config --cflags tbb)"
+    TBBFLAGS="-DTBB $(pkg-config --cflags tbb@BIT@)"
 
-    TBBLIBS="$(pkg-config --libs tbb)"
+    TBBLIBS="$(pkg-config --libs tbb@BIT@)"
 
 
     { printf "%s\n" "$as_me:${as_lineno-$LINENO}: checking tbb available for compiling and linking:" >&5
