R/R-seededlda/files/patch-use-right-prefix.diff
--- configure	2024-09-05 13:04:35.000000000 +0800
+++ configure	2024-09-06 13:43:22.000000000 +0800
@@ -595,7 +595,7 @@
 #
 # Initializations.
 #
-ac_default_prefix=/usr/local
+ac_default_prefix=@PREFIX@
 ac_clean_files=
 ac_config_libobj_dir=.
 LIBOBJS=
