science/mutationpp/files/eigen3-config.diff
diff --git CMakeLists.txt CMakeLists.txt
index af22f7d..c3ec3f8 100644
--- CMakeLists.txt
+++ CMakeLists.txt
@@ -186,7 +186,7 @@ endif()
 ###############################################################################
 
 # Eigen
-find_package(Eigen3)
+find_package(Eigen3 CONFIG)
 
 
 ###############################################################################
